In [2]:
import pandas as pd
from matplotlib import style
import matplotlib.pyplot as plt
style.use("ggplot")

In [13]:
web_stats = {"Day":[1,2,3,4,5,6],
             "Visitors" : [43,53,59,41,65,38],
             "Bounce_Rate" : [65,67,71,52,69,71]}

df = pd.DataFrame(web_stats)

# df.head()
# df.tail(2)
# print(df)
# df["Day"].values

   Day  Visitors  Bounce_Rate
4    5        65           69
5    6        38           71

In [24]:
# print(df.set_index("Day"))
# print(df.head()) # here we lost our index as it above function just
                 # return new dataframe instead of changing in original dataset.

In [25]:
# df = df.set_index("Day")
df.head()

     Visitors  Bounce_Rate
Day
1          43           65
2          53           67
3          59           71
4          41           52
5          65           69

In [27]:
# df.set_index("Day",inplace=True)

In [28]:
df['Visitors']

Day
1    43
2    53
3    59
4    41
5    65
6    38
Name: Visitors, dtype: int64

In [29]:
df.Visitors

Day
1    43
2    53
3    59
4    41
5    65
6    38
Name: Visitors, dtype: int64

In [30]:
print(df[['Visitors','Bounce_Rate']])

     Visitors  Bounce_Rate
Day
1          43           65
2          53           67
3          59           71
4          41           52
5          65           69
6          38           71

In [34]:
# df.Visitors.tolist()
df.Visitors.values.tolist()

[43, 53, 59, 41, 65, 38]

In [37]:
x = df[['Visitors','Bounce_Rate']]
import numpy as np
print(np.array(x))

[[43 65]
 [53 67]
 [59 71]
 [41 52]
 [65 69]
 [38 71]]

In [38]:
df2 =pd.DataFrame(np.array(x))
df2

    0   1
0  43  65
1  53  67
2  59  71
3  41  52
4  65  69
5  38  71

IO Basics -> Input Output

In [4]:
df = pd.read_csv("/home/balerion/Desktop/leetcode_Ai/Ai/dataset/ZILLOW-DATA.csv")

df.head()

  indicator_id  region_id        date          value
0         ZSFH      99999  2024-05-31  477697.848254
1         ZSFH      99999  2024-04-30  474916.546847
2         ZSFH      99999  2024-03-31  473581.871169
3         ZSFH      99999  2024-02-29  474057.293827
4         ZSFH      99999  2024-01-31  477769.775628

In [12]:
df.set_index('Date' , inplace=True)
df.dropna(inplace=True)
df.drop(columns="indicator_id",inplace=True)
df.drop(columns="region_id" , inplace=True)
df.head()

                    value
date
2024-05-31  477697.848254
2024-04-30  474916.546847
2024-03-31  473581.871169
2024-02-29  474057.293827
2024-01-31  477769.775628

In [13]:
df.to_csv("newcsv.csv")

In [14]:
df = pd.read_csv("/home/balerion/Desktop/leetcode_Ai/Ai/EDA/newcsv.csv")

df.head()

         date          value
0  2024-05-31  477697.848254
1  2024-04-30  474916.546847
2  2024-03-31  473581.871169
3  2024-02-29  474057.293827
4  2024-01-31  477769.775628

In [16]:
df = pd.read_csv("/home/balerion/Desktop/leetcode_Ai/Ai/EDA/newcsv.csv" , index_col=0) # as csv file has no such specific attribute of
                                                                                        #index so when we open again after altering 
                                                                                        # it will reset so we use "index_col = " to set index.
df.head()

                    value
date
2024-05-31  477697.848254
2024-04-30  474916.546847
2024-03-31  473581.871169
2024-02-29  474057.293827
2024-01-31  477769.775628

In [19]:
df.columns = ["Austin_HPI"] # ["col1" , "col2" , ........] renaming the columns
df.head()
df.to_csv("newcsv2.csv")
df.to_csv("newcsv3.csv" , header=False) # without heading

To read from a file without header

In [21]:
df = pd.read_csv("/home/balerion/Desktop/leetcode_Ai/Ai/EDA/newcsv3.csv" , names=["Date" , "Austin_HPI"],index_col=0)
df.head()

               Austin_HPI
Date
2024-05-31  477697.848254
2024-04-30  474916.546847
2024-03-31  473581.871169
2024-02-29  474057.293827
2024-01-31  477769.775628

Reading database table using pandas

In [32]:
import sqlite3
from sqlalchemy import create_engine

connection_string  = 'mysql+pymysql://user:password@localhost:3306/institutes'
engine = create_engine(connection_string)

query = "select * from institute_detail"

df = pd.read_sql_query(query ,engine,index_col='id') # we pass query and connection

df.head()

# df.to_csv("institute_detail.csv" ,index = False)

,name,institute_url,created_at,updated_at
id,,,,
1,Central University of Jharkhand,https://cuj.ac.in/,2023-09-27 17:51:37,2023-09-27 17:51:37
2,Babasaheb Bhimrao Ambedkar University,https://www.bbau.ac.in/,2023-09-27 17:51:44,2023-09-27 17:51:44
3,Aligarh Muslim University,https://www.amu.ac.in/,2023-09-27 17:51:54,2023-09-27 17:51:54
4,Assam University,http://www.aus.ac.in/,2023-09-27 17:51:55,2023-09-27 17:51:55
5,Banaras Hindu University,http://www.bhu.ac.in/,2023-09-27 17:52:01,2023-09-27 17:52:01

In [37]:
df = pd.read_csv("/home/balerion/Desktop/leetcode_Ai/Ai/EDA/institute_detail.csv",index_col=0)
df.head()

,name,institute_url,created_at,updated_at
id,,,,
1,Central University of Jharkhand,https://cuj.ac.in/,2023-09-27 17:51:37,2023-09-27 17:51:37
2,Babasaheb Bhimrao Ambedkar University,https://www.bbau.ac.in/,2023-09-27 17:51:44,2023-09-27 17:51:44
3,Aligarh Muslim University,https://www.amu.ac.in/,2023-09-27 17:51:54,2023-09-27 17:51:54
4,Assam University,http://www.aus.ac.in/,2023-09-27 17:51:55,2023-09-27 17:51:55
5,Banaras Hindu University,http://www.bhu.ac.in/,2023-09-27 17:52:01,2023-09-27 17:52:01

In [39]:
df.to_html("example.html") # converted into html

In [41]:
df = pd.read_csv("newcsv3.csv",names = ["Date" , "Austing_HPI"] , index_col=0)
df.head()

              Austing_HPI
Date
2024-05-31  477697.848254
2024-04-30  474916.546847
2024-03-31  473581.871169
2024-02-29  474057.293827
2024-01-31  477769.775628

In [44]:
df.rename(columns={"Austing_HPI":"Delhi_HPI"},inplace=True)
df.head()

                Delhi_HPI
Date
2024-05-31  477697.848254
2024-04-30  474916.546847
2024-03-31  473581.871169
2024-02-29  474057.293827
2024-01-31  477769.775628